ВЫБОР КОГДА Порядок=1 ТОГДА 
            ВЫБОР КОГДА ВычислитьВыражение("Сумма(СуммаПланБюджета)","МесяцБюджета" , , "Текущая", "Текущая") is null
                ТОГДА Сумма(ВычислитьВыражениеСГруппировкойМассив("Среднее(ОстаткиНачалоПлан)","Организация"))
                ИНАЧЕ Сумма(СуммаПланБюджета)                
            КОНЕЦ        
      КОГДА Порядок=110  ТОГДА 
            ВЫБОР КОГДА ВычислитьВыражение("Сумма(СуммаПланБюджета)", "МесяцБюджета", , "Текущая", "Текущая") is null
                ТОГДА Сумма(ВычислитьВыражениеСГруппировкойМассив("Среднее(ОстаткиКонецПлан)", "Организация"))
                ИНАЧЕ Сумма(СуммаПланБюджета)          
            КОНЕЦ
     КОГДА Порядок=120 ТОГДА
       500
	ИНАЧЕ
       Сумма(СуммаПланБюджета)
КОНЕЦ
